
&НаКлиенте
Процедура ДобавитьСертификаты(Команда)
	ОткрытьФорму("Справочник.СертификатыКлючейЭлектроннойПодписиИШифрования.Форма.ФормаПодключитьСертификат",,ЭтаФорма,ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ТестПодписи(Команда)
	 ПодписатьНаСервере(Элементы.Список.ТекущаяСтрока);
КонецПроцедуры

&НаСервере
Процедура ПодписатьНаСервере(сс)
	
	Таб = новый ТабличныйДокумент;
	Таб.Область(1,1,1,1).Текст = "ТЕСТ "+ТекущаяДата();
	
	Справочники.СертификатыКлючейЭлектроннойПодписиИШифрования.ПодписатьЭЦП(сс.фио,таб);
	
КонецПроцедуры
